<template>
  <div class="text_box_rules">
    <h2 class="rules_head">Правила программистического клуба</h2>
    <p class="rules">
    <ul>
      <li>Первое правило программистического клуба - никогда не упоминать об программистическом клубе</li>
      <li>Второе правило программистического клуба - ни за что не упоминать об программистическом клубе</li>
      <li>Третье правило программистического клуба - если девелопер крикнул "КОММИТ", выдохся или сделал пуш, проект
        закончен.</li>
      <li>Четвертое правило программистического клуба - в программирование участвуют лишь двое.</li>
      <li>Пятое правило программистического клуба - комиты идут одни за другим, а не одновременно.</li>
      <li>Шестое правило программистического клуба - не писать больше 1 строчки кода.</li>
      <li>Седьмое правило программистического клуба - прогать надо столько, сколько нужно.</li>
      <li>Восьмое и последнее правило программистического клуба - тот, кто нашел баг, должен дебагать весь код.</li>
    </ul>
    </p>
  </div>
</template>

<script>
export default {}
</script>

<style>
.text_box_rules {
  background-color: rgba(0, 0, 0, 50%);
  width: 880px;
  height: 650px;
  color: rgba(255, 255, 255, 85%);
  text-align: start;
  font-size: 25px;
  padding: 40px;
  border: black solid 5px;
  border-radius: 14px;
  box-shadow: 0px 0px 10px #8270F2;
  margin-right: 100px;
}

.rules_head {
  color: #8270F2;
}
</style>
